       IDENTIFICATION DIVISION.
       PROGRAM-ID. compute.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 DEC PIC 9(3) VALUE 9.
       01 Q PIC 9(3).
       01 R PIC 9(3).

       01 BIT0 PIC 9 VALUE 0.
       01 BIT1 PIC 9 VALUE 0.
       01 BIT2 PIC 9 VALUE 0.
       01 BIT3 PIC 9 VALUE 0.

       PROCEDURE DIVISION.

           COMPUTE BIT0 = FUNCTION REM (DEC 2).
           COMPUTE DEC = FUNCTION INTEGER-PART (DEC / 2).
           COMPUTE BIT1 = FUNCTION REM (DEC 2).
           COMPUTE DEC = FUNCTION INTEGER-PART (DEC / 2).
           COMPUTE BIT2 = FUNCTION REM (DEC 2).
           COMPUTE DEC = FUNCTION INTEGER-PART (DEC / 2).
           COMPUTE BIT3 = DEC / 2.

           DISPLAY BIT3 BIT2 BIT1 BIT0.
           STOP RUN.
