       IDENTIFICATION DIVISION.
       PROGRAM-ID. div_remainder.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 DEC PIC 9(3) VALUE 13.
       01 Q PIC 9(3).
       01 R PIC 9(3).

       01 BIT0 PIC 9 VALUE 0.
       01 BIT1 PIC 9 VALUE 0.
       01 BIT2 PIC 9 VALUE 0.
       01 BIT3 PIC 9 VALUE 0.

       PROCEDURE DIVISION.
           DIVIDE DEC BY 2 GIVING DEC REMAINDER BIT0.
           DIVIDE DEC BY 2 GIVING DEC REMAINDER BIT1.
           DIVIDE DEC BY 2 GIVING DEC REMAINDER BIT2.
           DIVIDE DEC BY 2 GIVING DEC REMAINDER BIT3.
           DISPLAY BIT3 BIT2 BIT1 BIT0.

           STOP RUN.
