      * this is a comment 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog01.
       AUTHOR. Glenn Noronha.
       INSTALLATION. WTAMU CS 3322.
       DATE-WRITTEN. 01/27/2025.
       DATE-COMPILED. 01/27/2025.
       SECURITY. Non-confidential.
      * another comment, can be placed in any row

       PROCEDURE DIVISION.
      * can put a statement in here (goes in area b)
           DISPLAY "Hello COBOL".
           STOP RUN.
           